metrics = {
    'LOC': 'LOC – метрика, що вказує на кількість фізичних рядків коду (включаючи пусті рядки та коментарі).',
    'NOC': 'NOC – метрика, що вказує на кількість класів у проекті.',
    'NDD': 'NDD – метрика, що вказує на кількість прямих нащадків.',
    'CALL': 'CALL – метрика, що вказує на кількість викликів методу.',
    'NOM': 'NOM – метрика, що вказує на кількість методів у програмному коді.',
    'WMC': 'WMC- метрика, що вказує на вагову значимість методів.(сума статичних складностей всіх методів в классі. Складність може бути, наприклад, цикломатичною складністю McCabe)',
    'TCC': 'TCC –метрика, що вказує на щільність згуртованості класу. (Відносна кількість пар методів класу, що мають доступ принаймні до одного спільного поля класу)',
    'PNAS': 'PNAS – метрика, що вказує на частки нових додаткових послуг. (Кількість публічних методів класу, що не є перезаписаною або спеціалізованю із предків, ділена на кількість всіх публічних методів)'
}
